{
    "projects": [
    { 
      "id": "a7B2xYz9Wq", 
      "title": "Sentiment Analysis and Prediction on Indonesian Presidential Candidature", 
      "description": "This project employed sentiment analysis to predict public opinion regarding Indonesian presidential candidates using Twitter/X data. The study compared the performance of Logistic Regression, LSTM, and BERT models, finding that BERT consistently delivered the highest accuracy after addressing class imbalance and fine-tuning. The best-performing BERT model was then integrated into a web application enabling real-time sentiment analysis of text, offering valuable insights into public sentiment trends and demonstrating the practical application of advanced NLP techniques for informed electoral understanding.", 
      "responsibility": ["Responsible for all aspects of the project"],
      "tools":["Flask", "Python", "HTML", "CSS", "Javascript", "VSCode", "Google Colab", "Github"],
      "badgeInfo":
        {
          "badge": "Academic",
          "badgeColor": "bg-green-500"
        },
      "images":[
        {
          "name": "candidate1",
          "path":
            "/project/candidate1.png"
        },
        {
          "name": "candidate2",
          "path":
            "/project/candidate2.png"
        },
        {
          "name": "candidate3",
          "path":
            "/project/candidate3.png"
        },
        {
          "name": "candidate4",
          "path":
            "/project/candidate4.png"
        }
      ],
      "link":[
        {
          "name": "Dataset",
          "path":
            "https://data.mendeley.com/datasets/7w5zvr8jgp/5"
        },
        {
          "name": "EDA",
          "path":
            "https://drive.google.com/file/d/1APnuOxC9wdYWDpd7hJFk5xdpWkIEYUzH/view?usp=sharing"
        },
        {
          "name": "LR Model",
          "path":
            "https://drive.google.com/drive/folders/1lX1gfab_psNphUtvyJ-MCpYHkI79cEbZ?usp=sharing"
        },
        {
          "name": "LSTM Model",
          "path":
            "https://drive.google.com/drive/folders/1Q9PpaWC3ON7ca8Th0oirhgDGUFxonNBt?usp=sharing"
        },
        {
          "name": "BERT Model",
          "path":
            "https://drive.google.com/drive/folders/1-7WsnEkxD9U4LEVJZt8SpzIsvm5Sr9x6?usp=sharing"
        }
      ]
    },
    { 
      "id": "pQ1vR5sT8j", 
      "title": "Service Orchestration", 
      "description": "Service Orchestration (SOC) delivers a comprehensive solution for rapid network issue resolution and proactive service management at Telkomsel. It provides real-time visibility into network health, automated root cause analysis, and proactive alerting. The system quantifies service impact and potential revenue loss, integrates with external tools for seamless data sharing, and incorporates robust data integrity checks, accessible incident reporting, and secure user management. This enables faster problem identification, improved network stability, and informed decision-making.", 
      "responsibility": ["UI/UX Design", "Frontend Development", "SQL Queries"],
      "tools":["HTML", "CSS", "Javascript", "MySQL", "NodeJS", "VSCode", "DBeaver", "Figma"],
      "badgeInfo":
        {
          "badge": "Professional",
          "badgeColor": "bg-blue-500"
        },
      "images":[
        {
          "name": "soc1",
          "path":
            "/project/soc1.png"
        },
        {
          "name": "soc2",
          "path":
            "/project/soc2.png"
        },
        {
          "name": "soc4",
          "path":
            "/project/soc4.png"
        },
        {
          "name": "soc3",
          "path":
            "/project/soc3.png"
        }
      ],
      "link": null
    },
    { 
      "id": "kLm0N3fGhI", 
      "title": "TM NGOSS NGT AI", 
      "description": "Telekom Malaysia's Next Generation Operations Support Service (TM NGOSS) project, incorporating Next Generation Transport (NGT) and Artificial Intelligence (AI), aims to revolutionize network management and enhance customer satisfaction. The project achieves this by correlating alarms network-wide to identify root causes, dramatically reducing alarm volume. Core components such as root-cause analysis, automation, and service impact analysis contribute to a significant reduction in problem resolution time – exceeding 50%. This results in faster, more accurate fixes, while proactive customer communication improves service quality and the overall customer experience. The future-proof NGOSS framework ensures the solution's long-term adaptability and value, evolving alongside the network to meet future challenges", 
      "responsibility": ["UI/UX Design", "Frontend Development"],
      "tools":["HTML", "CSS", "Typescript", "ReactJS", "Grafana", "VSCode", "Figma"],
      "badgeInfo":
        {
          "badge": "Professional",
          "badgeColor": "bg-blue-500"
        },
      "images":[
        {
          "name": "tm1",
          "path":
            "/project/tm1.png"
        },
        {
          "name": "tm2",
          "path":
            "/project/tm2.png"
        },
        {
          "name": "tm3",
          "path":
            "/project/tm3.png"
        },
        {
          "name": "tm4",
          "path":
            "/project/tm4.png"
        }
      ],
      "link": null
    },
    { 
      "id": "zYuXwV6CbA", 
      "title": "Adidas Sales Analysis and Recommendation", 
      "description": "The project aims to optimize sales strategies and improve overall business performance. The core objectives include increasing sales and profitability by analyzing unit sales data for each product category. The project will also focus on enhancing state-level performance by studying states exhibiting strong sales and profit performance, identifying best practices to replicate. Finally, the analysis will inform the development of future retail strategies by determining the most suitable sales methods, comparing the effectiveness of offline versus online channels to optimize resource allocation.", 
      "responsibility": ["Responsible for all aspects of the project"],
      "tools":["Tableau"],
      "badgeInfo":
        {
          "badge": "Academic",
          "badgeColor": "bg-green-500"
        },
      "images":[
        {
          "name": "adidas1",
          "path":
            "/project/adidas1.png"
        },
        {
          "name": "adidas2",
          "path":
            "/project/adidas2.png"
        },
        {
          "name": "adidas3",
          "path":
            "/project/adidas3.png"
        },
        {
          "name": "adidas4",
          "path":
            "/project/adidas4.png"
        }
      ],
      "link":[
        {
          "name": "Dataset",
          "path":
            "https://www.kaggle.com/datasets/heemalichaudhari/adidas-sales-dataset"
        },
        {
          "name": "Tableau",
          "path":
            "https://public.tableau.com/app/profile/fahri.aradiansyah/viz/AdidasSales_17180935472090/Dashboard"
        }
      ]
    },
    { 
      "id": "o9PqRs2TuV", 
      "title": "Text Highlighter and Dictionary Search",
      "description": "This project tackles the unique language challenges within the mental health domain, which includes specialized terms and informal expressions. The system pre-processes data using NLTK, then utilizes a fine-tuned ALBERT model to predict and correct both non-word (misspelled) and real-word (contextually incorrect) errors. Accuracy is further enhanced by a Bigram model that leverages common word combinations and Edit Distance, which measures word similarity. Gramformer provides context-aware grammar and spelling suggestions, ensuring clear and accurate communication.", 
      "responsibility": ["Responsible for all aspects of the model and its integration into the web application"],
      "tools":["Flask", "Python", "HTML", "CSS", "Javascript", "VSCode", "Google Colab", "Github"],
      "badgeInfo":
        {
          "badge": "Academic",
          "badgeColor": "bg-green-500"
        },
      "images":[
        {
          "name": "nlp1",
          "path":
            "/project/nlp1.png"
        },
        {
          "name": "nlp2",
          "path":
            "/project/nlp2.png"
        },
        {
          "name": "nlp3",
          "path":
            "/project/nlp3.png"
        },
        {
          "name": "nlp4",
          "path":
            "/project/nlp4.png"
        }
      ],
      "link": [
        {
          "name": "Github",
          "path":
            "https://github.com/fahriardsh/nlp-assignment"
        }
      ]
    },
    { 
      "id": "f7PqAs2GfJ", 
      "title": "Air Pollution Forecasting",
      "description": "This project uses Convolutional Neural Networks (CNNs) to improve air quality prediction, addressing the limitations of traditional models in handling complex pollution data influenced by weather and human activity. By training three CNN architectures (Basic, Deeper with Pooling, and with Dropout) on the Air Quality dataset and evaluating performance using MAE, MSE, and RMSE, the study aims to demonstrate that CNNs can significantly enhance prediction accuracy, benefiting public health and environmental policy.", 
      "responsibility": ["Responsible for all aspects of the project"],
      "tools":["Python", "Google Colab"],
      "badgeInfo":
        {
          "badge": "Academic",
          "badgeColor": "bg-green-500"
        },
      "images":[
        {
          "name": "dl",
          "path":
            "/project/dl.png"
        },
        {
          "name": "dl1",
          "path":
            "/project/dl1.png"
        },
        {
          "name": "dl2",
          "path":
            "/project/dl2.png"
        },
        {
          "name": "dl3",
          "path":
            "/project/dl3.png"
        },
        {
          "name": "dl4",
          "path":
            "/project/dl4.png"
        }
      ],
      "link":[
        {
          "name": "Dataset",
          "path":
            "https://www.kaggle.com/datasets/rupakroy/lstm-datasets-multivariate-univariate/data"
        },
        {
          "name": "EDA and Model",
          "path":
            "https://colab.research.google.com/drive/1mwJZg0hlLCQbl073r_rSJpONDP-sU8ct?usp=sharing"
        }
      ]
    },
    { 
      "id": "g3PfBs3SfA", 
      "title": "Telekom Churn Prediction",
      "description": "This project addresses the critical challenge of customer turnover, which significantly impacts revenue and profitability within the telecommunications sector. This study aims to predict churn and provide actionable insights for implementing effective retention strategies. Exploratory data analysis informed data pre-processing and guided the selection of Decision Tree, Naïve Bayes, and Random Forest algorithms for churn prediction. Model performance was evaluated using key metrics including accuracy, precision, recall, F1-score, and AUC, with the Random Forest model demonstrating superior performance, achieving an accuracy of 97%. These results underscore the Random Forest model's potential to accurately predict telecom churn, enabling the development of targeted customer retention strategies.", 
      "responsibility": ["Responsible for all aspects of the project"],
      "tools":["R", "R Studio"],
      "badgeInfo":
        {
          "badge": "Academic",
          "badgeColor": "bg-green-500"
        },
      "images":[
        {
          "name": "aml",
          "path":
            "/project/aml.png"
        },
        {
          "name": "aml1",
          "path":
            "/project/aml1.png"
        },
        {
          "name": "aml2",
          "path":
            "/project/aml2.png"
        },
        {
          "name": "aml3",
          "path":
            "/project/aml3.png"
        },
        {
          "name": "aml4",
          "path":
            "/project/aml4.png"
        }
      ],
      "link":[
        {
          "name": "Dataset",
          "path":
            "https://www.kaggle.com/datasets/barun2104/telecom-churn"
        }
      ]
    },
    { 
      "id": "xEa1F5sZiK", 
      "title": "Power Management System", 
      "description": "Power Management System (PMS) designed to improve energy efficiency, reduce operating costs, and enhance system reliability across Telkomsel's facilities, even when utilizing equipment from different vendors; the system achieves this through proactive fault, performance, and inventory management, providing real-time power usage monitoring to identify waste, implementing dynamic control strategies to optimize energy distribution, and featuring tiered alarm management (critical, major, minor, offline), alongside a comprehensive overview of total rectifier and battery availability, thereby facilitating informed decision-making and reducing downtime by proactively addressing potential equipment failures and inefficiencies in a multi-vendor environment.", 
      "responsibility": ["Frontend Development", "SQL Queries"],
      "tools":["HTML", "CSS", "Javascript", "PostgreSQL", "NodeJS", "VSCode", "DBeaver", "Figma"],
      "badgeInfo":
        {
          "badge": "Professional",
          "badgeColor": "bg-blue-500"
        },
      "images":[
        {
          "name": "pms1",
          "path":
            "/project/pms1.png"
        },
        {
          "name": "pms2",
          "path":
            "/project/pms2.png"
        },
        {
          "name": "pms3",
          "path":
            "/project/pms3.png"
        },
        {
          "name": "pms4",
          "path":
            "/project/pms4.png"
        }
      ],
      "link":null
    },
    { 
      "id": "dEs4F5gHiJ", 
      "title": "DTS Company Profile", 
      "description": "The Dreta Teknologi Solusindo (DTS) Company Profile project creates a concise and compelling overview of DTS, showcasing its core values, expertise, and commitment to client success. The profile outlines its key service offerings, and builds credibility through project case studies and testimonials. Ultimately, the profile serves as a powerful marketing tool, attracting new clients, partners, and talent by clearly communicating DTS's value proposition and track record.", 
      "responsibility": ["Responsible for all aspects of the project"],
      "tools":["HTML", "CSS", "Javascript"],
      "badgeInfo":
        {
          "badge": "Professional",
          "badgeColor": "bg-blue-500"
        },
      "images":[
        {
          "name": "dts1",
          "path":
            "/project/dts1.png"
        },
        {
          "name": "dts2",
          "path":
            "/project/dts2.png"
        },
        {
          "name": "dts3",
          "path":
            "/project/dts3.png"
        },
        {
          "name": "dts4",
          "path":
            "/project/dts4.png"
        }
      ],
      "link":[
        {
          "name": "Live",
          "path":
            "https://www.dreta-tech.com/public/"
        }
      ]
    }
  ]
}